scripts/load/k6-run-microservices.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 2m30s max duration (incl. graceful stop):
              * thirty_players: 1 iterations for each of 30 VUs (maxDuration: 2m0s, gracefulStop: 30s)


Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

Run              [ 100% ] setup()
thirty_players   [   0% ]

running (5m47.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
thirty_players   [   0% ] 30 VUs  0m00.4s/2m0s  00/30 iters, 1 per VU


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=212.73ms
    ✓ 'p(99)<1000' p(99)=331.09ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 30      0.086256/s
    checks_succeeded...: 100.00% 30 out of 30
    checks_failed......: 0.00%   0 out of 30

    ✓ answer submit is 2xx or 4xx (not 5xx)

    CUSTOM
    answer_rejections..............: 30     0.086256/s
    answer_submit_duration_ms......: avg=209.05031 min=196.622096 med=210.655862 max=214.821718 p(90)=212.781165 p(95)=213.927748

    HTTP
    http_req_duration..............: avg=101.52ms  min=7.22ms     med=101.39ms   max=460.43ms   p(90)=211.83ms   p(95)=212.73ms  
      { expected_response:true }...: avg=101.52ms  min=7.22ms     med=101.39ms   max=460.43ms   p(90)=211.83ms   p(95)=212.73ms  
    http_req_failed................: 0.00%  0 out of 141
    http_reqs......................: 141    0.405403/s

    EXECUTION
    iteration_duration.............: avg=1.21s     min=1.19s      med=1.21s      max=1.21s      p(90)=1.21s      p(95)=1.21s     
    iterations.....................: 30     0.086256/s
    vus............................: 30     min=0        max=30
    vus_max........................: 30     min=30       max=30

    NETWORK
    data_received..................: 134 kB 386 B/s
    data_sent......................: 42 kB  122 B/s



running (5m47.8s), 00/30 VUs, 30 complete and 0 interrupted iterations
thirty_players ✓ [ 100% ] 30 VUs  0m01.2s/2m0s  30/30 iters, 1 per VU